cypress/pdl/devices/psoc6/svd/psoc62.svd
        <value>119</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_22</name>
        <description>TCPWM #1, Counter #22</description>
        <value>120</value>
      </interrupt>
      <interrupt>
        <name>tcpwm_1_interrupts_23</name>
        <description>TCPWM #1, Counter #23</description>
        <value>121</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_0</name>
        <description>UDB Interrupt #0</description>
        <value>122</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_1</name>
        <description>UDB Interrupt #1</description>
        <value>123</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_2</name>
        <description>UDB Interrupt #2</description>
        <value>124</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_3</name>
        <description>UDB Interrupt #3</description>
        <value>125</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_4</name>
        <description>UDB Interrupt #4</description>
        <value>126</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_5</name>
        <description>UDB Interrupt #5</description>
        <value>127</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_6</name>
        <description>UDB Interrupt #6</description>
        <value>128</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_7</name>
        <description>UDB Interrupt #7</description>
        <value>129</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_8</name>
        <description>UDB Interrupt #8</description>
        <value>130</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_9</name>
        <description>UDB Interrupt #9</description>
        <value>131</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_10</name>
        <description>UDB Interrupt #10</description>
        <value>132</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_11</name>
        <description>UDB Interrupt #11</description>
        <value>133</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_12</name>
        <description>UDB Interrupt #12</description>
        <value>134</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_13</name>
        <description>UDB Interrupt #13</description>
        <value>135</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_14</name>
        <description>UDB Interrupt #14</description>
        <value>136</value>
      </interrupt>
      <interrupt>
        <name>udb_interrupts_15</name>
        <description>UDB Interrupt #15</description>
        <value>137</value>
      </interrupt>
      <interrupt>
        <name>pass_interrupt_sar</name>
        <description>SAR ADC interrupt</description>
        <value>138</value>
      </interrupt>
      <interrupt>
        <name>audioss_interrupt_i2s</name>
        <description>I2S Audio interrupt</description>
        <value>139</value>
      </interrupt>
      <interrupt>
        <name>audioss_interrupt_pdm</name>
        <description>PDM/PCM Audio interrupt</description>
        <value>140</value>
      </interrupt>
      <interrupt>
        <name>profile_interrupt</name>
        <description>Energy Profiler interrupt</description>
        <value>141</value>
      </interrupt>
      <interrupt>
        <name>smif_interrupt</name>
        <description>Serial Memory Interface interrupt</description>
        <value>142</value>
      </interrupt>
      <interrupt>
        <name>usb_interrupt_hi</name>
        <description>USB Interrupt</description>
        <value>143</value>
      </interrupt>
      <interrupt>
        <name>usb_interrupt_med</name>
        <description>USB Interrupt</description>
        <value>144</value>
      </interrupt>
      <interrupt>
        <name>usb_interrupt_lo</name>
        <description>USB Interrupt</description>
        <value>145</value>
      </interrupt>
      <interrupt>
        <name>pass_interrupt_dacs</name>
        <description>Consolidated interrrupt for all DACs</description>
        <value>146</value>
      </interrupt>
      <registers>
        <register>
          <name>CM0_CTL</name>
          <description>CM0+ control</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFA050002</resetValue>
          <resetMask>0xFFFF0003</resetMask>
          <fields>
            <field>
              <name>SLV_STALL</name>
              <description>Processor debug access control:
'0': Access.
'1': Stall access.

This field is used to stall/delay debug accesses. This is useful to protect execution of code that needs to be protected from debug accesses.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLED</name>
              <description>Processor enable:
'0': Disabled. Processor clock is turned off and reset is activated. After SW clears this field to '0', HW automatically sets this field to '1'. This effectively results in a CM0+ reset, followed by a CM0+ warm boot.
'1': Enabled.
Note: The intent is that this bit is modified only through an external probe or by the CM4 while the CM0+ is in Sleep or DeepSleep power mode. If this field is cleared to '0' by the CM0+ itself, it should be done under controlled conditions (such that undesirable side effects can be prevented).

Note: The CM0+ CPU has a AIRCR.SYSRESETREQ register field that allows the CM0+ to reset the complete device (ENABLED only disables/enables the CM0+), resulting in a warm boot. This CPU register field has similar 'built-in protection' as this CM0_CTL register to prevent accidental system writes (the upper 16-bits of the register need to be written with a 0x05fa key value; see CPU user manual for more details).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VECTKEYSTAT</name>
              <description>Register key (to prevent accidental writes).
- Should be written with a 0x05fa key value for the write to take effect.
- Always reads as 0xfa05.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM0_STATUS</name>
          <description>CM0+ status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>SLEEPING</name>
              <description>Specifies if the CPU is in Active, Sleep or DeepSleep power mode:
- Active power mode: SLEEPING is '0'.
- Sleep power mode: SLEEPING is '1' and SLEEPDEEP is '0'.
- DeepSleep power mode: SLEEPING is '1' and SLEEPDEEP is '1'.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SLEEPDEEP</name>
              <description>Specifies if the CPU is in Sleep or DeepSleep power mode. See SLEEPING field.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM0_CLOCK_CTL</name>
          <description>CM0+ clock control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000000</resetValue>
          <resetMask>0xFF00FF00</resetMask>
          <fields>
            <field>
              <name>SLOW_INT_DIV</name>
              <description>Specifies the slow clock divider (from the peripheral clock 'clk_peri' to the slow clock 'clk_slow'). Integer division by (1+SLOW_INT_DIV). Allows for integer divisions in the range [1, 256] (SLOW_INT_DIV is in the range [0, 255]).
 
Note that this field is retained. However, the counter that is used to implement the division is not and will be initialized by HW to '0' when transitioning from DeepSleep to Active power mode.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERI_INT_DIV</name>
              <description>Specifies the peripheral clock divider (from the high frequency clock 'clk_hf' to the peripheral clock 'clk_peri'). Integer division by (1+PERI_INT_DIV). Allows for integer divisions in the range [1, 256] (PERI_INT_DIV is in the range [0, 255]).
 
Note that this field is retained. However, the counter that is used to implement the division is not and will be initialized by HW to '0' when transitioning from DeepSleep to Active power mode.

Note that Fperi &lt;= Fperi_max. Fperi_max is likely to be smaller than Fhf_max. In other words, if Fhf = Fhf_max, PERI_INT_DIV should not be set to '0'.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM0_INT_CTL0</name>
          <description>CM0+ interrupt control 0</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0F0F0F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX0_SEL</name>
              <description>System interrupt select for CPU interrupt source 0. If the field value is 240, no system interrupt is connected and the CPU interrupt source is always '0'/de-activated.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX1_SEL</name>
              <description>System interrupt select for CPU interrupt source 1.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX2_SEL</name>
              <description>System interrupt select for CPU interrupt source 2.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX3_SEL</name>
              <description>System interrupt select for CPU interrupt source 3.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM0_INT_CTL1</name>
          <description>CM0+ interrupt control 1</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0F0F0F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX0_SEL</name>
              <description>System interrupt select for CPU interrupt source 4.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX1_SEL</name>
              <description>System interrupt select for CPU interrupt source 5.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX2_SEL</name>
              <description>System interrupt select for CPU interrupt source 6.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX3_SEL</name>
              <description>System interrupt select for CPU interrupt source 7.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM0_INT_CTL2</name>
          <description>CM0+ interrupt control 2</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0F0F0F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX0_SEL</name>
              <description>System interrupt select for CPU interrupt source 8.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX1_SEL</name>
              <description>System interrupt select for CPU interrupt source 9.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX2_SEL</name>
              <description>System interrupt select for CPU interrupt source 10.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX3_SEL</name>
              <description>System interrupt select for CPU interrupt source 11.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM0_INT_CTL3</name>
          <description>CM0+ interrupt control 3</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0F0F0F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX0_SEL</name>
              <description>System interrupt select for CPU interrupt source 12.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX1_SEL</name>
              <description>System interrupt select for CPU interrupt source 13.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX2_SEL</name>
              <description>System interrupt select for CPU interrupt source 14.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX3_SEL</name>
              <description>System interrupt select for CPU interrupt source 15.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM0_INT_CTL4</name>
          <description>CM0+ interrupt control 4</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0F0F0F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX0_SEL</name>
              <description>System interrupt select for CPU interrupt source 16.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX1_SEL</name>
              <description>System interrupt select for CPU interrupt source 17.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX2_SEL</name>
              <description>System interrupt select for CPU interrupt source 18.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX3_SEL</name>
              <description>System interrupt select for CPU interrupt source 19.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM0_INT_CTL5</name>
          <description>CM0+ interrupt control 5</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0F0F0F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX0_SEL</name>
              <description>System interrupt select for CPU interrupt source 20.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX1_SEL</name>
              <description>System interrupt select for CPU interrupt source 21.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX2_SEL</name>
              <description>System interrupt select for CPU interrupt source 22.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX3_SEL</name>
              <description>System interrupt select for CPU interrupt source 23.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM0_INT_CTL6</name>
          <description>CM0+ interrupt control 6</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0F0F0F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX0_SEL</name>
              <description>System interrupt select for CPU interrupt source 24.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX1_SEL</name>
              <description>System interrupt select for CPU interrupt source 25.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX2_SEL</name>
              <description>System interrupt select for CPU interrupt source 26.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX3_SEL</name>
              <description>System interrupt select for CPU interrupt source 27.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM0_INT_CTL7</name>
          <description>CM0+ interrupt control 7</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0F0F0F0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX0_SEL</name>
              <description>System interrupt select for CPU interrupt source 28.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX1_SEL</name>
              <description>System interrupt select for CPU interrupt source 29.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX2_SEL</name>
              <description>System interrupt select for CPU interrupt source 30.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MUX3_SEL</name>
              <description>System interrupt select for CPU interrupt source 31.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM4_PWR_CTL</name>
          <description>CM4 power control</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFA050001</resetValue>
          <resetMask>0xFFFF0003</resetMask>
          <fields>
            <field>
              <name>PWR_MODE</name>
              <description>Set Power mode for CM4</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Switch CM4 off
Power off, clock off, isolate, reset and no retain.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset CM4
Clock off, no isolated, no retain and reset.

